package ru.kpfu.itis.hometask2

object TypesRepository {
    val itemsList =
        listOf(
            Type(
                "Стратег",
                "На вершине одиноко. Стратеги это хорошо знают — это один из самых редких и стратегически одаренных типов личностей. " +
                        "Стратеги составляют всего два процента населения, а женщины с таким типом личности — это особенная редкость — всего 0,8 % населения. " +
                        "Им часто тяжело найти единомышленников, которые смогут поддержать их неустанный интеллект и их мышление шахматиста. Люди с типом личности Стратега " +
                        "одарены богатым воображением и одновременно решительны, амбициозны, но скрытны, чрезвычайно любопытны, но не тратят попусту свою энергию.",
                "https://i.pinimg.com/originals/f9/03/00/f90300ffcf63b3f0e6228a6f40940c34.png"
            ),
            Type(
                "Ученый",
                "Тип личности «Ученый» встречается довольно редко и составляет лишь три процента населения: " +
                        "это очень хорошо, ибо нет для таких людей нет большей неприятности, чем быть «как все». " +
                        "Ученые гордятся своей изобретательностью и творческой натурой, уникальным видением и живым интеллектом. " +
                        "Такой человек может быть известным философом, архитектором или эксцентричным профессором. Ученым принадлежат многие научные открытия в нашей истории.",
                "https://cdn131.picsart.com/359467319017211.png"
            ),
            Type(
                "Командир",
                "Командиры — это прирожденные лидеры. Люди с этим типом личности объединяют в себе харизму и уверенность, " +
                        "они обладают авторитетом, который собирает толпы вокруг одной общей цели. В отличие от более чувствительных " +
                        "Протагонистов Командиры характеризуются часто безжалостным уровнем рациональности и направляют свою энергию, " +
                        "уверенность и острый ум на достижение запланированных целей. Вероятно, хорошо, что такие люди составляют всего " +
                        "три процента населения, не затмевая собой более робких и чувствительных типов личности, которые составляют остальное" +
                        "население мира, однако нам следует поблагодарить Командиров за многие компании и учреждения, услугами которых мы пользуемся каждый день.",
                "https://static.neris-assets.com/images/personality-types/avatars/entj-commander.png"
            ),
            Type(
                "Полемист",
                "Полемист — величайший адвокат дьявола, который успешно разрушает все аргументы и мнения на мелкие составляющие, пуская их по ветру, чтобы все видели. В отличие от более целеустремленных личностей Полемисты делают это все не потому, что пытаются достичь какой-то стратегической задачи или глубинной цели, а просто для удовольствия. Никто так не обожает процесс ментального поединка, как Полемисты, поскольку это дает им возможность потренировать свой исключительно острый ум, широкую базу познаний и способность объединять разрозненные идеи в доказательства своей правоты.",
                "https://pbs.twimg.com/media/FLjQ3KpXwAMPGKe.png"
            ),
            Type(
                "Активист",
                "Активист — очень редкий тип личности. Активисты составляют менее одного процента населения, но оставляют яркий след в мире. У них врожденное чувство идеализма и моральности, а от других идеалистов их отличает решительность и целеустремленность. Активисты — это не ленивые мечтатели, а люди, которые способны предпринимать конкретные шаги для достижения своих целей и выполнения долгосрочной стратегии.",
                "https://pbs.twimg.com/media/FLjQ3KpXwAMPGKe.png"
            ),
            Type(
                "Посредник",
                "Посредники — истинные идеалисты, всегда ищущие искру добра даже в худших из людей или событий в попытке улучшить ситуацию. В то время, как многие воспринимают их как спокойных, сдержанных, даже стеснительных людей, в Посредниках горит внутреннее пламя и страсть, которые могут в какой-то момент засиять. Составляя всего 4% от населения, личности типа «Посредник» часто рискуют остаться непонятыми — но, когда они находят думающих схожим образом людей, с которыми они проводят время, появившаяся гармония становится источником радости и вдохновения.",
                "https://e-w-e.one/wp-content/uploads/2020/05/infp-mediator.jpg"
            ),
            Type(
                "Тренер",
                "Тренеры являются природными лидерами, полными страсти и харизмы. Составляя всего около двух процентов населения, эти люди встречаются среди наших политиков, наших тренеров, наших наставников, они распространяют влияние и вдохновляют остальных на достижения во имя улучшения мира. Тренеры от природы уверены в себе и оказывают влияние на людей, они с гордостью и радостью демонстрируют другим, как улучшить самого себя и мир вокруг.",
                "https://e-w-e.one/wp-content/uploads/2020/05/2yial0rk_400x400.jpg"
            ),
            Type(
                "Борец",
                "Борец — настоящий свободный дух. Борцы часто являются заводилами на вечеринках, однако они не сильно заинтересованы в шумихе и не склонны к наслаждению моментом, они наслаждаются социальными и эмоциональными контактами с другими. Очаровательные, независимые, энергичные и сострадательные — те 7 % населения, которые они составляют, можно, безусловно, почувствовать в любой толпе.",
                "https://cdn.dribbble.com/users/659051/screenshots/1743382/media/66b9a94ba316e230e735f82a67fd21cd.jpg?compress=1&resize=400x300&vertical=top"
            ),
            Type(
                "Логист",
                "Логисты гордятся своей честностью. Люди с этим типом личности имеют в виду то, что говорят, и когда они берут на себя обязательство что-то сделать, они обязательно доводят дело до конца.\n" +
                        "\n" +
                        "Этот тип личности составляет значительную часть населения в целом, и, хотя Логисты могут быть не особенно яркими или привлекающими внимание, они делают больше, чем их доля, чтобы поддерживать общество на прочном и стабильном фундаменте. В своих семьях и сообществах логисты часто заслуживают уважения за свою надежность, практичность и способность сохранять рассудительность и логику даже в самых стрессовых ситуациях.\n" +
                        "\n",
                "https://i.pinimg.com/originals/52/90/3d/52903d59588f85fae7715aa9b7db7eb8.png"
            ),
            Type(
                "Защитник",
                "В своей непритязательной, сдержанной манере Защитники помогают вращать мир. Трудолюбивые и преданные люди с этим типом личности испытывают глубокое чувство ответственности перед окружающими. Можно рассчитывать на то, что защитники уложатся в сроки, помнят дни рождения и особые случаи, " +
                        "поддерживают традиции и осыпают своих близких жестами заботы и поддержки. Но они редко требуют признания за все, что они делают, предпочитая вместо этого действовать за кулисами.",
                "https://e-w-e.one/wp-content/uploads/2020/05/isfj-defender.jpg"
            ),
            Type(
                "Менеджер",
                "Менеджеры являются представителями традиции и порядка, используя свое понимание того, что правильно, а что неправильно и " +
                        "социально приемлемо, для объединения семей и сообществ. Принимая ценности честности, самоотверженности и достоинства, люди " +
                        "с исполнительным типом личности ценятся за их четкие советы и наставления, и они с радостью идут впереди на трудных путях. Гордясь тем, что объединяет людей, руководители " +
                        "часто берут на себя роль организаторов сообщества, усердно работая над тем, чтобы собрать всех вместе для празднования заветных местных событий или для защиты традиционных ценностей, которые объединяют семьи и сообщества.",
                "https://i.pinimg.com/474x/0b/b5/20/0bb52077456664681199bafa9c12b6d3--estj-personality-bright-ideas.jpg"
            ),
            Type(
                "Консул",
                "Для Консулов \u200B\u200Bжизнь слаще, когда она разделена с другими. Люди с этим типом личности составляют основу многих сообществ, открывая свои дома и сердца друзьям, любимым и соседям.\n" +
                        "\n" +
                        "Это не значит, что Консулы любят всех или что они святые. Но консулы верят в силу гостеприимства и хороших манер и склонны испытывать чувство долга перед окружающими. " +
                        "Щедрые и надежные, люди с этим типом личности часто берут на себя ответственность — как в большом, так и в малом — сплачивать свои семьи и свои сообщества.",
                "https://i.pinimg.com/originals/5a/aa/6e/5aaa6e5ec42d3ad6872e35bffd5b0f36.png"
            ),
            Type(
                "Виртуозы",
                "Виртуозы любят исследовать своими руками и глазами, прикасаясь к окружающему миру и исследуя его с хладнокровным рационализмом и живой любознательностью. " +
                        "Люди с этим типом личности — прирожденные Создатели, они переходят от проекта к проекту, строят полезное и лишнее для удовольствия и учатся у своего окружения по ходу дела. " +
                        "Часто механики и инженеры, Виртуозы не находят большей радости, чем испачкать руки, разбирая вещи и собирая их снова, чуть лучше, чем они были раньше.",
                "https://static.neris-assets.com/images/types/avatars/istp-virtuoso.svg"
            ),
            Type(
                "Авантюрист",
                "Авантюристы — настоящие художники, хотя и не обязательно в общепринятом смысле. Для этого типа личности сама жизнь является холстом для самовыражения. От того, что они носят, до того, как они проводят свободное время, искатели приключений ведут себя так, что ярко отражают то, кем они являются как уникальные личности.\n" +
                        "\n" +
                        "И каждый авантюрист, безусловно, уникален. Движимые любознательностью и желанием попробовать что-то новое, люди с таким типом личности часто имеют множество увлекательных увлечений и интересов. Авантюристы с их исследовательским духом и способностью находить радость в повседневной жизни могут быть одними из самых интересных людей, которых вы когда-либо встречали. " +
                        "Единственная ирония? Непритязательные и скромные авантюристы склонны считать себя «просто занимающимися своими делами», поэтому они могут даже не осознавать, насколько они замечательны на самом деле.",
                "https://static.neris-assets.com/images/personality-types/avatars/isfp-adventurer.png"
            ),
            Type("Предприниматель",
            "Предприниматели всегда оказывают влияние на свое непосредственное окружение — лучший способ обнаружить их на вечеринке — это посмотреть на кружащийся водоворот людей, порхающих вокруг них, когда они переходят из группы в группу. Смеясь и развлекаясь с грубым и приземленным юмором, личности-предприниматели любят быть в центре внимания. " +
                    "Если кого-то из зрителей просят выйти на сцену, Предприниматели вызываются добровольцами или приглашают застенчивого друга.",
            "https://i.pinimg.com/originals/e7/47/9d/e7479d5969e4673e18d023a7efd057db.png"),
            Type("Развлекатель",
            "Если и можно найти человека, который спонтанно начинает петь и танцевать, то это тип личности «Развлекатель». Артисты увлечены волнением момента и хотят, чтобы все остальные тоже чувствовали то же самое. Ни один другой тип личности не так щедро тратит свое время и энергию, как Артисты, когда дело доходит до поощрения других, и ни один другой тип личности не делает это с таким неотразимым стилем.",
            "https://i.pinimg.com/736x/29/80/d5/2980d54291f9a448135286fa68340a2f.jpg")
            )
}
